# SQLite

In [1]:
import sqlite3

In [ ]:
# Create a connection to databases

con = sqlite3.connect('example.db')
con

In [ ]:
# Create a cursor to execute queries

cursor = con.cursor()

In [ ]:
# SQL query

cursor.execute('''
CREATE TABLE IF NOT EXISTS Employees(
    Id INT PRIMARY KEY,
    Name TEXT NOT NULL, 
    Salary INT,
    Country TEXT 
)
''')

# Commit changes to the databases

con.commit()

In [5]:
cursor.execute('''
SELECT * FROM Employees
''')

In [7]:
cursor.execute('''
INSERT INTO Employees (Name, Salary, Country) VALUES
('Dhanasekar', 1000000, 'India')
''')

con.commit()

In [9]:
cursor.execute('''
SELECT * FROM Employees
''')

# Fetching result from output
rows = cursor.fetchall()

for row in rows:
    print(row)

(None, 'Dhanasekar', 1000000, 'India')

In [10]:
cursor.execute('''
UPDATE Employees 
SET Salary = 100000''')

con.commit()

cursor.execute('''
SELECT * FROM Employees
''')

rows = cursor.fetchall()

for row in rows:
    print(row)

(None, 'Dhanasekar', 100000, 'India')

In [12]:
cursor.execute('''
DELETE FROM Employees
WHERE Name = 'Dhanasekar'
''')

con.commit()

cursor.execute('''
SELECT * FROM Employees
''')

rows = cursor.fetchall()

for row in rows:
    print(row)

In [14]:
emp = [ (1, 'Dhanasekar', 100000, 'India'),
        (2, 'Azzizat', 40000, 'Nigeria'),
        (3, 'Kennady', 40000, 'Nigeria'),
        (4, 'Ana', 30000, 'Maxico')]

cursor.executemany('''
INSERT INTO Employees VALUES (?, ?, ?, ?)
''', emp)

con.commit()

cursor.execute('''
SELECT * FROM Employees
''')

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Dhanasekar', 100000, 'India')
(2, 'Azzizat', 40000, 'Nigeria')
(3, 'Kennady', 40000, 'Nigeria')
(4, 'Ana', 30000, 'Maxico')

In [15]:
# close the connection of the databases

con.close()